report/evaluations/wrk_results/Couchbase/proxy_load_performance
##############################################
##############################################
proxy 10 hr
###############################################
###############################################
samiras-mbp:wrk samirarabbanian$ ./wrk -t400 -c400 -d10h --latency http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
Running 600m test @ http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
  400 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.30s     2.04s    8.15s    68.39%
    Req/Sec     0.67      0.93    28.00     83.01%
  Latency Distribution
     50%  976.83ms
     75%    4.97s 
     90%    5.35s 
     99%    6.02s 
  15612858 requests in 600.01m, 143.44GB read
  Socket errors: connect 0, read 0, write 0, timeout 64222
Requests/sec:    433.69
Transfer/sec:      4.08MB
samiras-mbp:wrk samirarabbanian$ 


##############################################
##############################################
proxy 1 hr
###############################################
###############################################

samiras-mbp:wrk samirarabbanian$ ./wrk -t400 -c400 -d1h --latency http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
Running 60m test @ http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
  400 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58s     1.39s    5.56s    80.21%
    Req/Sec     0.75      0.69    13.00     47.05%
  Latency Distribution
     50%  907.51ms
     75%    1.32s
     90%    4.19s
     99%    5.46s
  1580714 requests in 60.02m, 14.52GB read
  Socket errors: connect 0, read 0, write 0, timeout 7039
Requests/sec:    438.96
Transfer/sec:      4.13MB


##############################################
##############################################
proxy 10 min
###############################################
###############################################

samiras-mbp:wrk samirarabbanian$ ./wrk -t400 -c400 -d10m --latency http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
Running 10m test @ http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
  400 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28s   773.10ms   5.47s    77.49%
    Req/Sec     0.86      0.79     8.00     57.15%
  Latency Distribution
     50%  911.75ms
     75%    1.38s
     90%    2.52s
     99%    3.57s
  266316 requests in 10.00m, 2.45GB read
  Socket errors: connect 0, read 0, write 0, timeout 592
Requests/sec:    443.74
Transfer/sec:      4.17MB
samiras-mbp:wrk samirarabbanian$


##############################################
##############################################
proxy 10 sec
###############################################
###############################################
$ ./wrk -t400 -c400 -d10 --latency http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
Running 10s test @ http://Administrator:password@127.0.0.1:1235/pools/default/buckets/beer-sample
  400 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34s   125.41ms   1.64s    64.01%
    Req/Sec     0.07      0.25     1.00     93.21%
  Latency Distribution
     50%    1.34s
     75%    1.45s
     90%    1.50s
     99%    1.60s
  2875 requests in 10.00s, 27.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 11
Requests/sec:    287.39
Transfer/sec:      2.71MB